var bookTypes = {
    literature:{
        title:"文学",
        img:"type01.jpg",
        list:[
            {
                name:"小说",
                content:["外国小说","中国当代小说","中国古典小说","中国近现代小说","悬疑推理","科幻小说","世界名著四大名著","作品集"]
            },
            {
                name:"文集",
                content:["外国诗歌","中国古诗词","中国现当代诗歌","外国散文","中国现当代散文","中国古代散文文学理论","文集","戏剧"]
            },
            {
                name:"青春文学",
                content:["玄幻/科幻","悬疑/惊悚","叛逆/成长","爆笑/无厘头","校园","港台青春文学","外国青春文学"]
            }
        ]
    },
    sciences:{
        title:"社科",
        img:"type02.jpg",
        list:[
            {
                name:"历史",
                content:["中国史","世界史","地方史志","历史知识读物","史料典籍","史学理论","考古文物","民族史志"]
            },
            {
                name:"政治/哲学",
                content:["政治","军事","中国政治","国际政治","外交/国际关系哲学","宗教","美学 哲学知识读物","中国古代哲学"]
            },
            {
                name:"文化",
                content:["世界文化","中国文化","中国民俗","地域文化","文化理论","文化评述","神秘现象"]
            },
            {
                name:"社会科学",
                content:["心理学","人类学","教育","社会学","新闻传播出版","语言文字"]
            },
            {
                name:"经济/管理",
                content:["经济理论","中国经济","国际经济","经济通俗读物","保险","会计","金融投资 市场营销","管理学","电子商务"]
            },
            {
                name:"成功励志",
                content:["成功激励","口才演讲","名人励志","人际交往","人生哲学","心灵修养","性格习惯"]
            },
            {
                name:"法律",
                content:["法的理论","法律法规","国际法","经济法"]
            }  
        ]
    },
    juvenile:{
        title:"少儿",
        img:"type03.jpg",
        list:[
            {
                name:"儿童文学",
                content:["中国儿童文学","外国儿童文学","童话","小说","寓言传说"]
            },
            {
                name:"绘本",
                content:["动漫/卡通"]
            },
            {
                name:"科普",
                content:["百科科普","百科","历史读物","生活常识","益智游戏","传统文化"]
            },
            {
                name:"其他",
                content:["幼儿启蒙","少儿英语","励志/成长","艺术课堂"]
            },
            {
                name:"年龄馆",
                content:["0-2岁","3-6岁","7岁及以上"]
            }
        ]
    },
    art:{
        title:"艺术",
        img:"type04.jpg",
        list:[
            {
                name:"绘画",
                content:["绘画理论","国画","油画","素描速写","水粉水彩"]
            },
            {
                name:"书法纂刻",
                content:["碑帖","技法教程","书法理论","硬笔书法","字帖","篆刻"]
            },
            {
                name:"摄影/设计",
                content:["设计","摄影后期","摄影教程","摄影理论","摄影器材","数码摄影","作品集"]
            },
            {
                name:"舞台影视艺术",
                content:["影视理论","影视赏析","影视制作","舞台/戏曲艺术"]
            },
            {
                name:"音乐",
                content:["钢琴","吉它","理论/欣赏","声乐","通俗音乐","外国音乐","中国民族音乐","作曲/指挥"]
            },
            {
                name:"收藏鉴赏",
                content:["宝石","雕品","古代家具","钱币","收藏百科","收藏随笔","书画","陶瓷","玉器"]
            },
            {
                name:"更多",
                content:["艺术理论","雕塑","工艺美术","建筑艺术","民间艺术","人体艺术","艺术类考试"]
            }
        ]
    },
    life:{
        title:"生活",
        img:"type05.jpg",
        list:[
            {
                name:"美食",
                content:["饮食文化","保健食谱","家常食谱","八大菜系","餐饮指南","世界美食"]
            },
            {
                name:"保健/心理健康",
                content:["健康百科","健身","心理健康","中老年","中医保健常见病"]
            },
            {
                name:"旅游",
                content:["旅游随笔","旅游攻略","旅游画册","城市自助游","国内自助游","国外自助游","地图地理"]
            },
            {
                name:"孕产育儿",
                content:["孕产百科","育儿百科"]
            },
            {
                name:"更多",
                content:["美丽妆扮","两性关系","家居休闲","个人理财"]
            }
        ]
    },
    culture:{
        title:"文教",
        img:"type06.jpg",
        list:[
            {
                name:"中小学教辅",
                content:["语文阅读","拓展读物","高考","初中通用","高中通用","工具书教师用书"]
            },
            {
                name:"外语",
                content:["英语读物","职业英语","英语考试","大学英语","少儿英语"]
            },
            {
                name:"教材",
                content:["研究生/本科/专科教材 ","职业技术培训","中小学教材"]
            },
            {
                name:"计算机",
                content:["操作系统/系统开发","数据库","信息安全程序设计","电脑杂志","计算机教材","计算机考试认证","计算机理论","计算机体系结构","家庭与办公室用书","企业软件开发与实施","人工智能软件工程/开发项目管理"]
            },
            {
                name:"更多",
                content:["考试","家庭教育","自然科学","科普读物","医学","农林业","工业技术","建筑"]
            }
        ]
    }
}

localStorage.setItem("bookTypes",JSON.stringify(bookTypes));

let slides = [
    "slides01.jpg","slides02.jpg","slides03.jpg","slides04.jpg","slides05.jpg","slides06.jpg"
];
localStorage.setItem("slides",JSON.stringify(slides));

let guessLikes = [
    {
        title:"所有人问所有人",
        newPrice:8,
        oldPrice:38,
        desc:"无论你是谁，来自哪儿，做着什么，你都可以向任何人提问，提问任何问题，这些问题，韩寒、李承鹏、王中磊、苏紫紫、贾樟柯、铁凝、周云蓬、高晓松、李银河、熊培云……为你回答。韩寒的一个工作室主编，所有人问所有人。",
        author:"一个工作室主编",
        publishing:"湖南人民出版社",
        publishDate:"2015-05-01",
        img:"like01.jpg"
    },
    {
        title:"舞姬",
        newPrice:8,
        oldPrice:25,
        desc:"本书收入森鸥外中短篇小说九部，《舞姬》用浪漫抒情的笔调，描写了一对异国青年男女纯洁凄迷的爱情故事，zui后以悲剧结局，被誉为日本浪漫主义文学的开山之作；《信使》、《泡沫记》描写了两个洁身自好、追求幸福却又终于不得不牺牲于封建势力压迫的女子；《雁》讲述了一位出身贫苦、受人欺骗的高利贷外室，当有了蒙胧的觉醒，决心追求自己幸福生活的时候，希望却化为泡影的令人唏嘘的悲剧。无论是描写欧洲留学生活，还是状写日本风土人情，作家笔下都流淌着浓郁的感伤，洋溢着个性解放的反封建主题。 ",
        author:"森欧外",
        publishing:"吉林出版集团",
        publishDate:"2014-01-01",
        img:"like02.jpg"
    },
    {
        title:"孟森讲清史",
        newPrice:18.6,
        oldPrice:58,
        desc:"本书选用孟森在北京大学教书采用的讲义《清史讲义》，分为上下两编，上编总论为清史在史学上的位置、清史的体例、青代种族及世系、八旗制度考实四章；下编各论分为开国、巩固国基、全盛、嘉道守文、咸同之转危为安五章。全书对清朝二百多年之政治、经济、文化进行了全面的述评，史实详尽，考订了清先世源流、八旗制度原貌，并对清代从开国到国运由盛转衰的过程和重要史实进行了缜密的论析。 ",
        author:"孟森",
        publishing:"东方出版社",
        publishDate:"2007-04-01",
        img:"like03.jpg"
    },
    {
        title:"布鲁克林",
        newPrice:18.6,
        oldPrice:58,
        desc:"一九五零年代初，爱尔兰东南部小镇恩尼斯科西。小镇姑娘艾丽斯与许多同龄人一样，找不到工作，前途茫茫。所以突然有一天去美国工作的机会降临时，人人心里都知道，她必须去。艾丽丝告别亲人和家乡，来到人生地不熟的布鲁克林，住进拥挤的集体公寓。这里有房东太太挑剔的目光，有其他租房的姑娘微妙的妒忌和猜疑，令她愈发感到孤独。 全新的生活节奏令艾丽丝渐渐淡忘背井离乡的痛楚——白天在百货商店当营业员，晚上到大学夜校进修，周五的傍晚还去教堂聚会、跳舞——她觉得自己获得了某种新的快乐。正当她陷入热恋之中时，家乡来的消息令她必须赶回家；她将面临的，不是回归过去的生活，而是必须在家乡新的生活与布鲁克林奋斗、扎根的未来之间，做出抉择。 《布鲁克林》是一个关于漂泊与回归、挚爱与痛失、个人的自由与责任的故事，沉静、细腻而温柔。托宾创造了令人难忘的女主人公艾丽丝·莱西，也创作出一部感情饱满的杰作。 ",
        author:"(爱尔兰)科尔姆·托宾",
        publishing:"上海文艺出版社",
        publishDate:"2016-01-01",
        img:"like04.jpg"
    },
    {
        title:"阿里阿德涅的子弹",
        newPrice:6.3,
        oldPrice:29.8,
        desc:"日本超级畅销书作家海堂尊力作《阿里阿德涅的子弹》，“白色荣光系列“之三——“田口和白鸟”再次登场！近乎完美的伪装杀人手段，噩梦般72小时，让你整夜惊叫！医疗话题、双方逻辑与逻辑激烈的对决与竞赛，带你一起感受田口和白鸟噩梦般的72小时！ 　　一声突然响起的枪声打破了医院的平静，东城大学医院再起恶性杀人事件！自从东城大学医院花重金引进了新型mri大型医疗设备后，二连三地发生各种离奇事件，所有人都生活在恐惧之中。凶手用杀人现场留下的子弹巧妙地设下了陷阱，院长被怀疑为受贿犯和杀人犯！“这里面绝对隐藏着不可告人的秘密！”外派医生田口公平和厚生劳动厅白鸟圭辅联手挑战近乎完美的伪装杀人手段，同真正的犯人展开逻辑与逻辑的激烈的对决 全新的生活节奏令艾丽丝渐渐淡忘背井离乡的痛楚——白天在百货商店当营业员，晚上到大学夜校进修，周五的傍晚还去教堂聚会、跳舞——她觉得自己获得了某种新的快乐。正当她陷入热恋之中时，家乡来的消息令她必须赶回家；她将面临的，不是回归过去的生活，而是必须在家乡新的生活与布鲁克林奋斗、扎根的未来之间，做出抉择。 《布鲁克林》是一个关于漂泊与回归、挚爱与痛失、个人的自由与责任的故事，沉静、细腻而温柔。托宾创造了令人难忘的女主人公艾丽丝·莱西，也创作出一部感情饱满的杰作。 ",
        author:"[日]海堂尊",
        publishing:"陕西师范大学出版社",
        publishDate:"2012-04-01",
        img:"like04.jpg"
    }
];
localStorage.setItem("guessLikes",JSON.stringify(guessLikes));

let selected = [
    {
        title:"一只特立独行的猪",
        newPrice:22.1,
        oldPrice:35,
        desc:"我觉得黑色幽默是我的气质，是天生的。——王小波?本书为王小波杂文代表作，王小波终其一生思考着并快乐着，他以独有的调侃的笔调完成了对自由与理性的反思与书写。书中对女权主义、科学与迷信、同性恋、小说创作、知识分子等话题进行剖解，展现了一座智性的迷宫，让读者从他那里学会如何独立而自由地思考，真切地体会到作为一个独立个体，应有的尊严与自由。这种观点在上世界九十年代点爆了一代人的青春，放在当下，依然具有鲜活的感染力",
        author:"王小波",
        publishing:"北京十月文艺出版社",
        publishDate:"2017-04-01",
        img:"selected01.jpg"
    },
    {
        title:"逝去的武林:一代形意拳大师口述历史",
        newPrice:18.6,
        oldPrice:38,
        desc:"口述者李仲轩出身于书香门第，年轻时拜入三位形意拳大师唐维碌、尚云祥和薛颠门下，深得形意拳大义；后隐于市井几十年，不为武术表演化和商品化潮流所侵扰，洁身自好；及至晚年，机缘巧合之际，娓娓道来三位大师的言行和武学，用zui朴实的语言勾勒出一幅传统武术界的人物风貌图，并透露了许多从前秘而不宣的练武秘技。滴水映月，令后学者得以窥见与传统文化水乳交融的原汁原味的中华武学。一代形意拳大师，为什么甘愿做一个普通的看门人？在人生的zui后几年，他为什么又突然开口，将自己毕生经验和盘托出？ ",
        author:"李仲轩 徐皓峰",
        publishing:"人民文学出版社",
        publishDate:"2014-01-01",
        img:"selected02.jpg"
    },
    {
        title:"史记十五讲-中国典籍与文化-第六辑",
        newPrice:8.2,
        oldPrice:39,
        desc:"《史记十五讲·中国典籍与文化》主要内容包括：《史记》是一部继往开来的百科全书、《史记》对中国历史学的贡献、《史记》对中国文学的贡献、史家之绝唱无韵之《离骚》、司马迁的写人艺术、司马迁悲壮抒怀感动读者两千年、秦汉之际天下三嬗——司马迁笔下的陈胜、项羽、刘邦、长风呼啸马蹄声碎——司马迁笔下的楚汉相争等等。 ",
        author:"张大可",
        publishing:"国家图书馆出版社",
        publishDate:"2010-04-01",
        img:"selected03.jpg"
    },
    {
        title:"中国社会史研究",
        newPrice:15.3,
        oldPrice:73,
        desc:"《中国社会史研究》内容简介：20世纪七八十年代之际，冯尔康教授对僵化史学极为不满，立意探索新的史学观念和学科内涵，开始致力于中国社会史研究，并着力与同好共同推动它在史学界取得应有的地位，给历史学添注了新的活力。《中国社会史研究》一书即选辑冯尔康教授关于社会史理论、史料和研究方法的重要文章，以对建设社会史学科有所裨益。《中国社会史研究》还辑录了冯尔康教授关于中国社会结构史与农民史、文化心态史研究的文章，如皇帝崇拜文化心态、历史上爱国思想的发展、当代中华文化建设与资源利用、皇家生育与生育观念以及中华饮食文化等方面的论述。",
        author:"冯尔康. 著",
        publishing:"天津人民出版社",
        publishDate:"2010-10-01",
        img:"selected04.jpg"
    },
    {
        title:"北京乎(上下册)--中国文库. 文学类",
        newPrice:34,
        oldPrice:40,
        desc:"这里入选作品的七十四位作家，和他们的一百二十一篇文章，为一九一九――一九四九这三十年间的北平历史风云作了侧面的描述，既可以使我们对北平有更多的了解，又是不可多得的美文。",
        author:"姜德明",
        publishing:"生活.读书.新知三联书店",
        publishDate:"2005-07-18",
        img:"selected05.jpg"
    }
];
localStorage.setItem("selected",JSON.stringify(selected));

let recommend = [
    {
        title:"高兴死了",
        newPrice:37.7,
        oldPrice:59,
        desc:"我正在人生低谷，我现在高兴死了！一位抑郁症患者将自己的故事写成《高兴死了！！！》，用快乐席卷美国年度榜单！揽下美国亚马逊年度图书、美国巴诺书店年度图书、美国有声书协会年度图书等，盘踞《纽约时报》畅销书榜近半年！风行美国、英国、德国、法国、意大利、西班牙、葡萄牙、俄罗斯、保加利亚、匈牙利等欧美多国。鼓舞千千万万读者。我疯狂收集每一个快乐的瞬间，用它们回击每一个糟糕的日子。 ",
        author:"珍妮.罗森",
        publishing:"江苏文艺出版社",
        publishDate:"2018-03-01",
        img:"recommend01.jpg"
    },
    {
        title:"刺杀骑士团长(全二册)",
        newPrice:75.5,
        oldPrice:98,
        desc:"“我”36岁，美术科班出身，原本爱好抽象画，多年来为了养家糊口成为专业肖像画家。结婚六周年纪念日前，妻子毫无征兆地提出已有外遇，要求离婚，于是“我”独自离家开车在外游荡了一个半月，*终应好友雨田政彦之邀，住进小田原郊外山间其父雨田具彦的旧居兼画室，期待通过环境的改变调整心情。奇妙的事件就发生在搬家后不到八个月的时间里。雨田政彦帮“我”介绍了山下绘画班任教的工作，“我”和班里的两位人妻先后成了情人，经神秘邻居免色的精心策划,和班上的少女真理惠也建立了密切联系。房子主人雨田具彦是著名日本画画家，“我”搬进那栋房子后不久，意外在阁楼发现了一幅雨田具彦不为世人所知的大师级作品，名为“刺杀骑士团长”。",
        author:"(日)村上春树 著 林少华 译",
        publishing:"上海译文",
        publishDate:"2018-03-01",
        img:"recommend02.jpg"
    },
    {
        title:"我们为什么会恐惧:42+N个科学未解之谜",
        newPrice:38.9,
        oldPrice:58,
        desc:"未知与不确定会导致恐惧。看似万能的科学也会有“碰壁”的时候，而这面“未解之墙”似乎比我们想象得还要广阔。从宇宙的边界在哪里这样的宏观问题，到人类神秘的心灵感应和种种无法解决的衰老、疾病、天才大脑，再到古老的狮身人面像……本书从宇宙、人体、古代历史、密码破译和自然现象，这五个方面介绍了目前大众关注的未解之谜。你会读到许多科学家为解答这些问题的所做出的研究与假设，至于那些尚未解答的谜团，就等待着聪明的你去探索啦！",
        author:"英国未来出版社",
        publishing:"中国画报出版社",
        publishDate:"2017-06-01",
        img:"recommend03.jpg"
    },
    {
        title:"放学后",
        newPrice:32.9,
        oldPrice:45,
        desc:"我在这所女子高中教数学五年了，日子风平浪静，但近来一切都变了。上周六去学校的路上，有人突然撞过来，我险些跌落铁轨；星期一放学后，我在学校淋浴，差点中机关触电；星期二放学后，我经过教学楼，从三楼飞出一个花盆砸向我头顶；星期四放学后，在我常用的更衣室内有人中毒死去，而且现场的门被人从里面顶住了。我报了警，自己也决心调查，没想到学校里又有人死去了，而我在回家的夜路上被人驾车猛然撞击。这一次放学后，我还躲得掉吗？",
        author:"东野圭吾 (作者), 赵峻 (译者)",
        publishing:"南海出版社",
        publishDate:"2017-09-01",
        img:"recommend04.jpg"
    },
    {
        title:"朱光潜经典作品集:给青年的十二封信(增订本)",
        newPrice:24.7,
        oldPrice:38,
        desc:"本书是著名美学家、文艺理论家、教育家、翻译家朱光潜先生阐发人生修养途径的经典著作，是其旅欧期间写给国内青年朋友的信，文中对青少年关心的话题，读书、升学、作文、做人、修身、谈情、爱恋等话题进行了深入而全面的探讨，告诫青年人要树立远大理想，眼光要深远，思想要明澈，夯实基础，勿贪图世俗名利。这些书信读来却仍发人深省、引人入胜，长期以来深受广大青年的欢迎。",
        author:"朱光潜",
        publishing:"文化发展出版社",
        publishDate:"2018-03-01",
        img:"recommend05.jpg"
    },
];
localStorage.setItem("recommend",JSON.stringify(recommend));


var bestSelling = [
    "哀悼人","宋明理学与政治文化-当代中国学术文库.海外卷","费正清中国史","越战亲历记","给我的孩子讲：史前史","平凡的世界-普及本","读了明朝不明白","苏菲的世界","多彩的流放","大设"
];
localStorage.setItem("bestSelling",JSON.stringify(bestSelling));

let taoshutuan = [
    {
        title:"学研图鉴：花",
        newPrice:69,
        oldPrice:256,
        desc:"按28个大类、175个科罗列了生活在地球上的约9000种鸟，包括已经灭绝的、濒临灭绝的鸟类都有列举。内容由三部分组成：第一部分介绍了鸟类的行为；第二部分分类介绍了各种鸟的个体形态特点、生活地区和习性特点；第三部分是鸟类资料馆，除介绍鸟类特征、观鸟方法及鸟类的保护等知识之外，还介绍了鸟类饲养和观赏的方法。",
        author:"王亮生 张正旺",
        publishing:"北方妇女儿童出版社",
        publishDate:"2014/10/01",
        img:"taoshu01.jpg"
    },
    {
        title:"中东史610-2000",
        newPrice:59.9,
        oldPrice:148,
        desc:"《中东史610-2000(上下)》是一部关于中东地区各国历史文化的学术专著，也是教育部“新世纪优秀人才支持计划”研究项目。该书共约110万字，正文分为十章，记述了包括埃及、新月地带、阿拉伯半岛在内的阿拉伯世界以及土耳其和伊朗等西亚北非诸多区域历史文明及中东各国的现代化文明进程，总结了伊斯兰传统文明的基本特征：即教俗合一的国家形态，国家所有制的土地制度，穆斯林与非穆斯林的社会对立。中东现代化进程的历史轨迹则表现在现代民族国家的兴起与绝对主义的现代化模式，工业化的演进趋势，地权的演变与乡村农业的发展，社会生活的变迁，宪政制度与民主化进程，世俗主义与伊斯兰主义等方面。",
        author:"哈全安",
        publishing:"天津人民出版社",
        publishDate:"2010/01/01",
        img:"taoshu02.jpg"
    },
    {
        title:"中世纪初期吐鲁番绿洲的物质生活",
        newPrice:59,
        oldPrice:187.8,
        desc:"历史上的西域，曾经是东西方文明碰撞与交融的中心，而古代高昌王国——今天的新疆吐鲁番地区，正处这个文明中心的前沿。在这片广阔的土地卜，匈奴、汉族、吐蕃、回鹘等先后涌入，袄教、摩尼教、佛教、伊斯兰教等陆续到来……从而成就了古高昌辉煌灿烂、迥异于中原的物质文明。《中世纪初期吐鲁番绿洲的物质生活》对不同民族及宗教在古代高昌地区留下的建筑、服装、丧葬等门类众多的物质文明状况进行了深入，细致的探讨与研究，展示了这一地区的历史风貌，具有较高的参考价值。",
        author:"【法】莫尼克·玛雅尔 著，耿昇 译",
        publishing:"中国国际广播出版社",
        publishDate:"2012/06/01",
        img:"taoshu03.jpg"
    },
    {
        title:"中国伦理大辞典",
        newPrice:26,
        oldPrice:78,
        desc:"中国的伦理道德，不仅体现在思想家们的著述中，记载于经史子书里，还体现在政治家、军事家、科学家、文学家的嘉言懿行、乃至普通人的言语活动里，记载于寓言传说、戏曲小说、稗官野史之中。伦理道德不但存在于文化领域，而且渗透到经济、政治、军事、法律、民族事务等各个方面",
        author:"陈瑛 许启贤",
        publishing:"辽宁人民出版社",
        publishDate:"1998/01/01",
        img:"taoshu04.jpg"
    }
];
localStorage.setItem("taoshutuan",JSON.stringify(taoshutuan));

var newbooks = [
    {
        title:"小饼干",
        newPrice:6.9,
        oldPrice:32.8,
        desc:"随着烘焙热潮越来越浓，烘焙爱好者越来越多，一本简单、快速、操作简易的烘焙指导书在市场上的呼声越来越高，本稿就是把常见的、简单的、可口的饼干甜点的做法，用图文并茂的方式完美呈现在读者面前。本稿包含60种简单易做的饼干小点心，图文示范，步骤详细，文字简洁明了，每个实例还配有小贴士，让操作者在烘焙过程中细节把握更好，做出来的饼干更加美味可口",
        author:"吴金燕",
        publishing:"中国纺织出版社",
        publishDate:"2014-06-01",
        img:"newbook01.jpg"
    },
    {
        title:"30岁种棵摇钱树60岁养老不求人",
        newPrice:5.3,
        oldPrice:25,
        desc:"当今的日本，经济衰退，人人都担心退休后拿不到养老金。但作者仍然在不景气的情况下年入百万，对中国的工薪族来说这本书很有借鉴意义，30年后如果遇到经济下行期，怎样“荒野求生”也是一种非常有必要的锻炼。 　　本书作者结合自己的亲身经历，用低调的幽默为读者讲述了“个人投资者”这个不用去公司就能赚钱的传奇般的职业。 　　 书中详细介绍了从事投资必须的7种能力，并向适合做股票或房地产的读者分别讲解了从事投资的方法。掌握了一定的方法，它将成为一个不受市场行情左右、稳定赚钱的职业。 　　作者认为，这些方法都很简单，只要坚持，人人都可以实现不用担心失业，不用担心养老，不用被时间和金钱束缚，虽然不及亿万富翁富足，但没有压力的生活。",
        author:"吉川英一",
        publishing:"中国青年出版社",
        publishDate:"2012-10-01",
        img:"newbook02.jpg"
    },
    {
        title:"不会作报告,怎敢拼职场",
        newPrice:6.1,
        oldPrice:29,
        desc:"",
        author:"（德）格里特•丹茨 著，李莉　译",
        publishing:"中国青年出版社",
        publishDate:"2011-09-01",
        img:"newbook03.jpg"
    },
    {
        title:"抄底－股市低买高卖的10个信号",
        newPrice:8.2,
        oldPrice:39,
        desc:"投资者都知道低买高卖是股票交易颠扑不破的真理，但为何在股市中多数人都不能做到，以致惨淡空忙？关键在于找不到股市底部头部，不知何时离场进场。本书中，作者教你发现股市底部头部的讯号与基本分析，为你提供股市进场离场的相关理论与策略。只需融会贯通，你就可以抓住机遇，一举翻身致富。作者认为，股市就像一头怪兽，只有“等待”才能制服它，投资者只要学会这套投资方法，就可以耐心等待进场时机，再耐心等待卖股时机。作者希望以此书将22年投资经验倾囊相授，教你在股市变幻中进退有据。",
        author:"郭泰",
        publishing:"中国青年出版社",
        publishDate:"2011-01-01",
        img:"newbook04.jpg"
    },
    {
        title:"超级短线新武器",
        newPrice:9,
        oldPrice:43,
        desc:"本书介绍了21世纪技术分析领域zui具创新性的方法，告诉交易者如何利用艾略特波浪理论、卢卡斯和斐波纳契序列，以及蜡烛图和时间因素，准确定位股市时机。从而在交易中获利。作者杰夫•格林布拉特在前人研究的基础上，发展了定位时机的多种方法，这些方法可以应用到技术分析的各个领域，将会大大提高股民和基金管理者在交易和做出投资决策时的准确率。投资者可以结合本书提供的案例和图表掌握这些概念和方法，当时机来临时，就可以把握好时机，获得超额利润。",
        author:"（美）格林布拉特 著，催明香，郭苗 译",
        publishing:"中国青年出版社",
        publishDate:"2008-05-01",
        img:"newbook05.jpg"
    },
    {
        title:"五胡录",
        newPrice:19.5,
        oldPrice:39.8,
        desc:" 《五胡录》由火焰塔著：秦时，始皇赢政天下一统，威震八荒，“胡人不敢南下而牧马，士不敢弯弓而报怨。”然而自两汉以来，不断有胡人向中原内地迂徙，逐渐盘踞中国北部地区，势力不断壮大。在漫长的中原文明发展史中，曾有长达约150年的时间，被汉人称为“夷狄”、“五胡”的勇武剽悍的马背民族，征服了黄河以北的中原腹地，diyi次打败了优越感极强的汉民族，驱赶着汉民旅狼狈南逃，喘息度日，史称“五胡乱华”。 ",
        author:"火焰塔",
        publishing:"中国三峡出版社",
        publishDate:"2012-10-01",
        img:"newbook06.jpg"
    }
];
localStorage.setItem("newbooks",JSON.stringify(newbooks));

var selfSupport = [
    {
        title:"小说",
        list:[
            {
                "title": "我们悲惨的宇宙",
                "newPrice": 9.9,
                "oldPrice": 36,
                "desc": "达特茅斯，达特摩尔东南部，是一片充满神秘传说的土地。靠做影子写手和写书评为生的科幻作家梅格，几年前与男友私奔到这里。几年下来，这段关系渐渐陷入无望，而她似乎爱上了一个上了年纪、有生活伴侣的历史学教授。梅格生活在各种“时",
                "author": "托马斯",
                "publishing": "重庆大学出版社",
                "publishDate": "2013-01-01",
                "img": "novel01.jpg"
            },
            {
                "title": "看这儿.照相啦!",
                "newPrice": 9.9,
                "oldPrice": 28,
                "desc": "　《看这儿,照相啦!》是库尔特冯内古特未出版的短篇小说集，精选了十四篇短篇小说，秉承冯内古特一贯的幽默，每个故事都是一则寓言，用夸张幽默的手法再现了工厂、酒吧等地方发生的生活趣事。这些寓言式的故事优美耐读，充分体",
                "author": "冯内古特",
                "publishing": "重庆大学出版社",
                "publishDate": "2013-06-01",
                "img": "novel02.jpg"
            },
            {
                "title": "百年孤独",
                "newPrice": 30.8,
                "oldPrice": 39.5,
                "desc": "《百年孤独》是魔幻现实主义文学的代表作，描写了布恩迪亚家族七代人的传奇故事，以及加勒比海沿岸小镇马孔多的百年兴衰，反映了拉丁美洲一个世纪以来风云变幻的历史。作品融入神话传说、民间故事、宗教典故等神秘因素，巧妙地糅合了现",
                "author": "马尔克斯 著；范晔 译",
                "publishing": "南海出版公司",
                "publishDate": "2011-06-01",
                "img": "novel03.jpg"
            },
            {
                "title": "山楂树之恋",
                "newPrice": 19.6,
                "oldPrice": 28,
                "desc": "静秋是个漂亮的城里姑娘，因为父亲是地主后代，家庭成份不好，文革时很受打击，静秋一直很自卑。静秋和一群学生去西村坪体验生活，编教材。她住在村长家，认识了“老三”。老三喜欢上了静秋，很喜欢，静秋怕他欺骗她，起初常常躲避。英",
                "author": "艾米 著",
                "publishing": "江苏人民出版社",
                "publishDate": "2009-12-01",
                "img": "novel04.jpg"
            },
            {
                "title": "阿加莎.克里斯蒂侦探推理系列:沉睡的谋杀案",
                "newPrice": 7.3,
                "oldPrice": 17,
                "desc": "格温达刚搬进新家,怪事就接二连二连三地发生。尽管她煞费苦心地对房子做了装修,结果却不断地挖掘出它的过去。更有甚者,每次上楼她都会产生莫名其妙的恐惧感。惊慌之中,她请简·马普尔为她驱除心魔。殊不知,一件发生在多年之前的“",
                "author": "&lt;英&gt;阿加莎.克里斯蒂",
                "publishing": "人民文学出版社",
                "publishDate": "2007-08-01",
                "img": "novel05.jpg"
            },
            {
                "title": "洞灵小志 续志 补志",
                "newPrice": 14.6,
                "oldPrice": 48.6,
                "desc": "这是一本讲述离我们不太久远的鬼怪故事的书，多为20世纪二三十年代民间以及士大夫之间流传的各类奇闻异事。谈鬼说狐居多，间及公案游侠、海内异闻，诸如赶尸、移腐、接火、查花等湘粤奇俗，均首见于此书。故事多为作者亲闻亲历，",
                "author": "郭则沄",
                "publishing": "东方出版社",
                "publishDate": "2010-04-01",
                "img": "novel06.jpg"
            },
            {
                "title": "霍乱时期的爱情",
                "newPrice": 32.2,
                "oldPrice": 49.5,
                "desc": "★原著首印量是《百年孤独》的150倍，中文版已售100万册！★这部光芒闪耀、令人心碎的作品是人类有史以来最伟大的爱情小说。——《纽约时报》★《霍乱时期的爱情》是我最好的作品，是我发自内心的创作。——加西亚·马尔",
                "author": "马尔克斯",
                "publishing": "南海出版公司",
                "publishDate": "2015-06-01",
                "img": "novel07.jpg"
            },
            {
                "title": "纽约兄弟",
                "newPrice": 10.8,
                "oldPrice": 25,
                "desc": "霍默和兰利是一对兄弟，父母双亡。两人住在纽约第五大道高尚地段的一套豪宅中。弟弟霍默十多岁起双眼逐渐失明；哥哥兰利则在一战中为神经毒气所伤，回家后举止、思想异于常人。兰利怀有远大理想：总结人类生活所有经验，办一张可以永远",
                "author": "多克托罗",
                "publishing": "人民文学出版社",
                "publishDate": "2011-11-01",
                "img": "novel08.jpg"
            },
            {
                "title": "信长之棺",
                "newPrice": 17.2,
                "oldPrice": 35,
                "desc": "信长死于本能寺之变，但最后众人找不到信长的尸体，于是信长忠心耿耿的手下太田牛一希望可以替信长写传记，并找回遗骸。当他开始深入追查幕后的真相时，却意外发现本能寺之变并非出于单纯的部将叛变，而是政治角力下的结果；对织",
                "author": "(日)加藤广",
                "publishing": "吉林出版集团",
                "publishDate": "2012-07-01",
                "img": "novel09.jpg"
            },
            {
                "title": "楚尘文化-灰故事",
                "newPrice": 9.9,
                "oldPrice": 29.8,
                "desc": "《灰故事》收录了阿乙早期的小说三十篇，共分为六章。第一次出版在2008年，此次再版删去三篇，增添两篇。阿乙：“我在《灰故事》里展现了太多故事（而不是文学）、太多模仿的影子（包括对皮兰德娄、博尔赫斯、阿利桑德罗巴里科",
                "author": "阿乙",
                "publishing": "重庆大学出版社",
                "publishDate": "2013-01-01",
                "img": "novel10.jpg"
            }
        ]
    },
    {
        title:"诗歌散文",
        list:[
            {
                "title": "四手联弹",
                "newPrice": 12.9,
                "oldPrice": 38,
                "desc": "合作开始了！世俗，趣味，随意，是我们的宗旨。无政治，无思想，无锋芒，是图册的特色。他在新疆，我在北京，各写各的。他的题目，我不涉及；我的题目，他不过问。遇到共同感兴趣的话题，合写一篇。写完交换一看，彼此大笑。",
                "author": "贺卫方，章诒和",
                "publishing": "广西师范大学出版社",
                "publishDate": "2010-04-01",
                "img": "poetry01.jpg"
            },
            {
                "title": "百人小品：酒之趣",
                "newPrice": 7.4,
                "oldPrice": 18,
                "desc": "酒，春饮宜庭，夏饮宜郊，秋饮宜舟，冬饮宜室，夜饮宜月，而愁饮宜醉，豪饮宜众。酒，源于水又浓于水，能上国宴又能进入寻常百姓家；战时少了不字，议和时离不开它；有人恨它，有人爱它；李白斗酒诗百篇，罗斯福靠解除禁酒令连任",
                "author": "彭国梁",
                "publishing": "珠海出版社",
                "publishDate": "2004-11-01",
                "img": "poetry02.jpg"
            },
            {
                "title": "尘世是唯一的天堂(名家笔下的生老病死)",
                "newPrice": 8.7,
                "oldPrice": 28,
                "desc": "本书是现当代中国文化名人话题小品集，选录了鲁迅、陈独秀、朱光潜、林语堂、许地山、萧乾、黄苗子、俞平伯、汪曾祺、董桥、史铁生、沈从文、张承志等八十位名家关于人生话题的散文九十余篇。选文作者大多有着不同寻常的人生经历，",
                "author": "林语堂　等著，老品　选编",
                "publishing": "中国国际广播出版社",
                "publishDate": "2007-08-01",
                "img": "poetry03.jpg"
            },
            {
                "title": "红楼脂粉英雄谱",
                "newPrice": 8.7,
                "oldPrice": 34.8,
                "desc": "本书欲将芹书所为一百零八位女子(小才、微善、英雄……皆各论其一端一面，或诗或曲，各各不同，本質则一)每位赠以小诗短句，以申鄙悃，以遣愚忠",
                "author": "周汝昌",
                "publishing": "漓江出版社",
                "publishDate": "2008-08-01",
                "img": "poetry04.jpg"
            },
            {
                "title": "寡人有疾",
                "newPrice": 14.2,
                "oldPrice": 29,
                "desc": "三段黑色幽默的故事，三种绝妙隐喻。《寡人有疾》一共有三个故事，第一个故事叫《诗人与医院》，讲唐朝诗人卢照邻，得了麻风病，遇到医圣孙思邈，虽然治不好病，但诗人信奉孙思邈的哲学；第二个故事叫《蒙古兵和瘟疫》，蒙古入侵开封之",
                "author": "苗炜",
                "publishing": "湖南文艺出版社",
                "publishDate": "2012-10-01",
                "img": "poetry05.jpg"
            },
            {
                "title": "茨威格散文选(外国名家散文丛书)",
                "newPrice": 8,
                "oldPrice": 21,
                "desc": "茨威格是一位充满人道主义激情的著名作家，他思想深邃，感情丰富，目光敏锐，笔触细腻。他非常善于对一些重大的社会题材和历史事件进行独到的观察和独特的描述，他尤其擅长深入人的内心世界，对人性以及人的灵魂暗影实施一种近乎残酷的",
                "author": "（奥地利）茨威格　著，绿原　等译",
                "publishing": "百花文艺出版社",
                "publishDate": "2009-06-01",
                "img": "poetry06.jpg"
            },
            {
                "title": "外国名家散文丛书--陀思妥耶夫斯基散文选",
                "newPrice": 11.6,
                "oldPrice": 21,
                "desc": "陀思妥耶夫斯基在我国读者中早已以他的长篇小说享有盛誉。《陀思妥耶夫斯基散文选》收作者的散文二十九篇，计二十万字，大多选自上述的《作家日记》。在陀思妥耶夫斯基散文的海洋中，这只不过是一捧水珠、一串浪花而已。《陀思妥耶夫",
                "author": "陀思妥耶夫斯基&nbsp;&nbsp;刘季星译",
                "publishing": "百花文艺出版社",
                "publishDate": "2009-06-03",
                "img": "poetry07.jpg"
            },
            {
                "title": "纯净集-劳伦斯随笔",
                "newPrice": 10,
                "oldPrice": 25,
                "desc": "DH劳伦斯，英国作家和诗人。自幼习画、练习写作。在短短20年的写作生涯中，出版了12部长篇小说，50多部中短篇小说，多部诗集，大量的散文随笔和一些翻译作品。举办了画展，出版了绘画集，是英国现代文学艺术领域内罕见的文艺通才。身",
                "author": "D.H.劳伦斯",
                "publishing": "中国国际广播出版社",
                "publishDate": "2009-01-01",
                "img": "poetry08.jpg"
            },
            {
                "title": "聆听宇宙的歌唱",
                "newPrice": 12,
                "oldPrice": 28,
                "desc": "",
                "author": "莫言",
                "publishing": "中国文史出版社",
                "publishDate": "2012-05-01",
                "img": "poetry09.jpg"
            },
            {
                "title": "毕淑敏散文精选",
                "newPrice": 19.6,
                "oldPrice": 28,
                "desc": "",
                "author": "毕淑敏著",
                "publishing": "长江文艺出版社",
                "publishDate": "2009-07-01",
                "img": "poetry10.jpg"
            }
        ]
    },
    {
        title:"悬疑推理",
        list:[
            {
                "title": "信长之棺",
                "newPrice": 17.2,
                "oldPrice": 35,
                "desc": "　　信长死于本能寺之变，但最后众人找不到信长的尸体，于是信长忠心耿耿的手下太田牛一希望可以替信长写传记，并找回遗骸。当他开始深入追查幕后的真相时，却意外发现本能寺之变并非出于单纯的部将叛变，而是政治角力下的结果；对织",
                "author": "(日)加藤广",
                "publishing": "吉林出版集团",
                "publishDate": "2012-07-01",
                "img": "suspense01.jpg"
            },
            {
                "title": "白马山庄杀人事件",
                "newPrice": 13.7,
                "oldPrice": 28,
                "desc": "一年前，女大学生直子的哥哥公一突然自杀可，死前留下一句令人费解的话玛丽什么时候回来。直子对于哥哥的死一直抱有怀疑，于是，跟新交的朋友诚以及失去哥哥的信州白马一同前往豪宅白",
                "author": "（日）东野圭吾　著",
                "publishing": "人民文学出版社",
                "publishDate": "2011-02-01",
                "img": "suspense02.jpg"
            },
            {
                "title": "阿里阿德涅的子弹",
                "newPrice": 6.3,
                "oldPrice": 29.8,
                "desc": "　　日本超级畅销书作家海堂尊力作《阿里阿德涅的子弹》，“白色荣光系列“之三——“田口和白鸟”再次登场！近乎完美的伪装杀人手段，噩梦般72小时，让你整夜惊叫！医疗话题、双方逻辑与逻辑激烈的对决与竞赛，带你一起感受田口和白",
                "author": "[日]海堂尊",
                "publishing": "陕西师范大学出版社",
                "publishDate": "2012-04-01",
                "img": "suspense03.jpg"
            },
            {
                "title": "一个背叛日本的日本人",
                "newPrice": 13.5,
                "oldPrice": 29.9,
                "desc": "1945年春，二战末期，败局已定的日本军政府制定了疯狂的“一亿玉碎本土决战计划”，准备牺牲一亿国民来保卫天皇，将同盟国拖入两败俱伤的混局；在整个日本为此陷入狂乱之际，一等外交官野上显一郎被悄悄推上了决定历史走向的转折点。<b<p=\"\"></b<>",
                "author": "松本清张",
                "publishing": "江苏文艺出版社",
                "publishDate": "2012-03-01",
                "img": "suspense04.jpg"
            },
            {
                "title": "一的悲剧",
                "newPrice": 9,
                "oldPrice": 28,
                "desc": "　　“是谁杀了我儿子？”　　我真想理直气壮地如此大声呐喊。　　可是，一旦揭穿了这个秘密，　　多年来我拼命保护的一切　　就将瞬间化为乌有！　　我好害怕，比什么都害怕……　　“是你杀的——",
                "author": "(日)法月纶太郎",
                "publishing": "吉林出版集团",
                "publishDate": "2012-05-01",
                "img": "suspense05.jpg"
            },
            {
                "title": "日本推理名作选:梦野久作.卷1",
                "newPrice": 10.6,
                "oldPrice": 28,
                "desc": "在那阴沉深渊残留着永无止息的怨恨声响，蕴含着无法以人力消除的悲情执念，犹如堕入无问地狱虽死亦无法解脱的魂魄的叹息、漂浮于八方天涯彷徨无助的幽鬼之声……《日本推理名作选》收录了日本战前变格派推理大师梦野久作的作品13",
                "author": "梦野久作",
                "publishing": "吉林出版集团有限责任公司",
                "publishDate": "2009-02-01",
                "img": "suspense06.jpg"
            },
            {
                "title": "不可能犯罪诊断书-V",
                "newPrice": 9,
                "oldPrice": 28,
                "desc": "山姆·霍桑只是美国一个小镇上的执业医师，不但要照顾全镇居民的健康，偶尔更要客串一下侦探的角色，调查这小镇里离奇难解的悬案。　　长久的医师职业，使他以诊断病情时的逻辑思维，来面对乍看之下几乎是不可能发生的犯罪事",
                "author": "霍克",
                "publishing": "吉林出版集团",
                "publishDate": "2012-11-01",
                "img": "suspense07.jpg"
            },
            {
                "title": "刑场",
                "newPrice": 9,
                "oldPrice": 28,
                "desc": "1963年冬天，古老而封闭的斯卡代尔村就像一个游离于世界之外的独立存在。小女孩爱丽森的神秘失踪打破了这个世界的宁静，而同时被打破的还有人性的平和…",
                "author": "[英]薇儿•麦克德米德  著",
                "publishing": "陕西师范大学出版社",
                "publishDate": "2011-10-01",
                "img": "suspense08.jpg"
            },
            {
                "title": "唤醒死者",
                "newPrice": 9.5,
                "oldPrice": 28,
                "desc": "寒冬一月的清晨，天方破晓，犹如被画笔涂成了灰色一般。伦敦的皮卡迪利大街上，有一个人正瑟瑟发抖，他就是克里斯托弗·肯特…",
                "author": "约翰·狄克森·卡尔",
                "publishing": "吉林出版集团",
                "publishDate": "2011-05-01",
                "img": "suspense09.jpg"
            },
            {
                "title": "写乐杀人事件",
                "newPrice": 11.9,
                "oldPrice": 35,
                "desc": "　　东洲斋写乐是日本浮世绘画坛的非凡天才，其出现和消失有如天际流星。他只有十个月的创作生命，却留下一百四十余幅版画，而且作画速度和风格变",
                "author": "[日]高桥克彦　著，果露怡 译",
                "publishing": "吉林出版集团有限责任公司",
                "publishDate": "2013-06-01",
                "img": "suspense10.jpg"
            }
        ]
    },
    {
        title:"青春文学",
        list:[
            {
                "title": "后宫:甄嬛传大结局",
                "newPrice": 19.6,
                "oldPrice": 28,
                "desc": "安陵容选择自杀，亦道出一生波澜的原委，而她死前唯一一句遗言为暂时平静的后宫埋下潜伏的杀机。皇后逐渐失宠，甄嬛掌握后宫大权，却依旧对皇后无可奈何。新秀入宫，重重危机再度迫来，连带着皇长子的婚事也充满明争暗斗。甄嬛再次被老",
                "author": "流潋紫著",
                "publishing": "重庆出版社",
                "publishDate": "2009-09-01",
                "img": "youth01.jpg"
            },
            {
                "title": "百妖物语",
                "newPrice": 9.5,
                "oldPrice": 29.8,
                "desc": "　　八百多年前，我是在战乱中不幸罹难的少女，饮泣于尸骨遍地的高野山，得幸被高僧以还魂术复活。此去经年，我的身体被永远禁锢在了十四岁，已经",
                "author": "翩竹 著",
                "publishing": "百花洲文艺出版社",
                "publishDate": "2013-10-01",
                "img": "youth02.jpg"
            },
            {
                "title": "那可不行哦",
                "newPrice": 11.5,
                "oldPrice": 36,
                "desc": "",
                "author": "佐野洋子",
                "publishing": "重庆大学出版社",
                "publishDate": "2014-08-01",
                "img": "youth03.jpg"
            },
            {
                "title": "镜.织梦者",
                "newPrice": 5,
                "oldPrice": 19.9,
                "desc": "一个凡间女作家萧音十年来用笔创作自己的“云荒”世界,也不知道是否太专注一个观念,它就会成为现实?奇迹出现,萧音真的成为了“云荒”世界的“造世主”,她的笔造就了“云荒”。十年来她无一日不在写“云荒”,如果一停笔整个云荒就覆灭、",
                "author": "沧月",
                "publishing": "万卷出版公司",
                "publishDate": "2009-01-01",
                "img": "youth04.jpg"
            },
            {
                "title": "疯狂植物园",
                "newPrice": 16.3,
                "oldPrice": 25,
                "desc": "《疯狂植物园·猎物者外传》由白饭如霜编著。《疯狂植物园·猎物者外传》讲述了：这里是撒哈拉之眼，这里是疯狂植物园。有桃树结出笔记本电脑，榕树挂着心情卡片，名为伦敦烟火的小黄花，因火焰而生，其势",
                "author": "白饭如霜",
                "publishing": "长江出版社",
                "publishDate": "2012-10-01",
                "img": "youth05.jpg"
            },
            {
                "title": "阁楼上的青春",
                "newPrice": 7.5,
                "oldPrice": 25,
                "desc": "《阁楼上的青春》是何大草的最新长篇力作，细腻而精致的语言，伴随情节的推进，南方古都宛如迟暮美人的凄迷风情，浓荫覆盖的阁楼，隐藏秘密的大剧院，蒙蒙的阳光和雨水，汗腻腻的夏天，压抑而忧伤的欲望，成",
                "author": "何大草　著",
                "publishing": "安徽文艺出版社",
                "publishDate": "2011-11-01",
                "img": "youth06.jpg"
            },
            {
                "title": "致我们终将逝去的青春-电影纪念版",
                "newPrice": 9.5,
                "oldPrice": 29.8,
                "desc": "自喻为\"玉面小飞龙\"的郑微,洋溢着青春活力,心怀着对邻家哥哥林静浓浓的爱意两人约定到了大学就交往可是当郑微终于考上林静所在城市的大学并联系林静时,却发现林静已经出国,并且事先没有告诉她任何消息生性豁达的她,埋藏起自己",
                "author": "辛夷坞",
                "publishing": "百花洲文艺出版社",
                "publishDate": "2013-05-01",
                "img": "youth07.jpg"
            },
            {
                "title": "千秋",
                "newPrice": 9.2,
                "oldPrice": 28.8,
                "desc": "继2008年出版的《不朽》《须臾》之后，落落退出第二套“作品集+图文随笔集”系列书——《千秋》《万象》。《千秋》收录落落2008年至2011年以来最优秀个人作品。“短篇小说不是一个容易挑战的题材，每一次要求一个精彩的故事",
                "author": "落落",
                "publishing": "长江文艺出版社",
                "publishDate": "2011-05-01",
                "img": "youth08.jpg"
            },
            {
                "title": "哑舍-贰",
                "newPrice": 12.3,
                "oldPrice": 25,
                "desc": "　　热闹与喧嚣的摩登城市，历史在这里无声沉积。那些神话传说中亦真亦假的奇珍异宝，曾一度遗落在历史的长河里。　　时隔一年，老板的“哑舍”古董店再次开业。千年不死的胡亥现身，寻找皇兄扶苏的灵魂，妄图将其灵魂复活，由此展开",
                "author": "玄色",
                "publishing": "长江出版社",
                "publishDate": "2012-04-01",
                "img": "youth09.jpg"
            },
            {
                "title": "被窝是青春的坟墓",
                "newPrice": 8.4,
                "oldPrice": 22,
                "desc": "在青春之书里，我们同在一行字之间。被窝是青春的坟墓。关于少年时代，冷暖自如，是朴素的生活，与最遥远的梦想。这一切将在被回忆肆意篡改的书写下，渐渐抽象成一些雾一样的尘埃，浮在梦境之外的空茫黑暗中，日日夜夜不停坠落，终会尘",
                "author": "七堇年",
                "publishing": "长江文艺出版社",
                "publishDate": "2007-11-01",
                "img": "youth010.jpg"
            }
        ]
    }
];
localStorage.setItem("selfSupport",JSON.stringify(selfSupport));

var pressList = [
    {
        "name": "人民文学出版社",
        "desc": "人民文学出版社以出版高档次高品位文化图书为主，兼顾通俗性读物。注重图书出版的系统性和系列化，力求较全面的反映中国及世界各国的优秀文学成果。已出版图书8000多种，发行近7亿册。其中翻译出版了80多个国家和地区的重要作家的作品近3000余种。系统的整理出版了30多位中外文学大师的全集，文集，出版汇集世界一流作家一流作品《世界文学名著文库》（200种，250卷），依文学史体系整理出版了中国古代和现代作家主要作品的图书系列。出版物以高质量赢得广泛称赞，已形成了高品位，高质量的“人文版”图书系列，被称赞“代表中国文学出版社的最高水平”。",
        "list": [
            {
                "title": "阿加莎.克里斯蒂侦探推理系列:沉睡的谋杀案",
                "newPrice": 7.3,
                "oldPrice": 17,
                "author": "(英)阿加莎.克里斯蒂",
                "img": "press01.jpg"
            },
            {
                "title": "在少女花影下-追寻逝去的时光-第二卷",
                "newPrice": 23.7,
                "oldPrice": 55,
                "author": "马塞尔·普鲁斯特(Marcel Proust)",
                "img": "press02.jpg"
            },
            {
                "title": "克雷洛春寓言精选-(增订版)",
                "newPrice": 3.9,
                "oldPrice": 10,
                "author": "克雷洛夫",
                "img": "press03.jpg"
            },
            {
                "title": "徐志摩选集上下——中国文库",
                "newPrice": 21.1,
                "oldPrice": 32,
                "author": "徐志摩",
                "img": "press04.jpg"
            },
            {
                "title": "晨钟响彻黄昏",
                "newPrice": 14.2,
                "oldPrice": 29,
                "author": "迟子建",
                "img": "press05.jpg"
            }
        ]
    },
    {
        "name": "作家出版社",
        "desc": "作家出版社是中国作家协会所属国家级大型文学出版社，自1953年建社以来，出版了大量的优秀文学图书，其中有部分作品先后被介绍到海外，在国内外产生了广泛影响。作家出版社以中国文学的主流作家为出版依托，出版了大量当代名家名作，巴金、王蒙、季羡林、铁凝、贾平凹、二月河、王安忆、莫言、张平、张抗抗、周梅森、余华、张承志、从维熙、金庸、董桥、周汝昌、张中行、汪曾祺、黄苗子、黄永玉、冯骥才、周国平、韩少功、毕飞宇、池莉、毕淑敏、蒋子龙、张贤亮、张炜、李国文、曹文轩、魏明伦、韩寒、张悦然等都有代表作品在作家出版社出版。",
        "list": [
            {
                "title": "长舌男",
                "newPrice": 12.7,
                "oldPrice": 29.5,
                "author": "贾平凹　著",
                "img": "press06.jpg"
            },
            {
                "title": "走向混沌三部曲-最新增补版",
                "newPrice": 16.8,
                "oldPrice": 39,
                "author": "从维熙",
                "img": "press07.jpg"
            },
            {
                "title": "金牧场",
                "newPrice": 8.4,
                "oldPrice": 22,
                "author": "张承志",
                "img": "press08.jpg"
            },
            {
                "title": "活着-余华作品",
                "newPrice": 18.2,
                "oldPrice": 28,
                "author": "余华",
                "img": "press09.jpg"
            },
            {
                "title": "小说课堂",
                "newPrice": 15.1,
                "oldPrice": 35,
                "author": "崔道怡　著",
                "img": "press10.jpg"
            }
        ]
    },
    {
        "name": "中华书局",
        "desc": "中华书局于1912年元旦由陆费逵先生在上海创办，是中国近现代最悠久的出版社之一。百馀年来，中华书局恪守传承文明职责，专注于优秀传统文化出版，在海内外享有盛誉。特别是从1958年至1978年，历经二十年时间，组织整理、出版的“二十四史”及《清史稿》点校本，被公认为新中国最伟大的古籍整理工程。相继编辑出版了《全上古三代秦汉三国六朝文》《先秦汉魏晋南北朝诗》《全唐文》《全唐诗》《全宋词》《古本小说丛刊》《甲骨文合集》《资治通鉴》《文苑英华》《太平御览》等一大批古代文史哲经典文献，在学术界、读书界、教育界有着广泛的影响。",
        "list": [
            {
                "title": "说慈禧-百家讲坛",
                "newPrice": 11.7,
                "oldPrice": 26,
                "author": "隋丽娟",
                "img": "press11.jpg"
            },
            {
                "title": "居延沧桑:寻找消失的绿洲",
                "newPrice": 16.2,
                "oldPrice": 36,
                "author": "景爱",
                "img": "press12.jpg"
            },
            {
                "title": "中国哲学史方法论发凡--中国文库. 哲学社会科学类",
                "newPrice": 8.5,
                "oldPrice": 10,
                "author": "张岱年",
                "img": "press13.jpg"
            },
            {
                "title": "楞严经-佛教十三经",
                "newPrice": 20.8,
                "oldPrice": 32,
                "author": "赖永海",
                "img": "press14.jpg"
            },
            {
                "title": "洪宪帝制:袁氏帝梦破灭记(公元1915-1916年)",
                "newPrice": 12.2,
                "oldPrice": 26,
                "author": "张华腾",
                "img": "press15.jpg"
            }
        ]
    },
    {
        "name": "现代出版社",
        "desc": "现代出版社成立于1982年，隶属于中国出版行业国家队——中国出版集团，被新闻出版总署评为“全国良好出版社”。现代出版社有限公司秉承中国出版集团“固本求新，弘文致远”的整体出版理念，结合自身出版产品特色，先后出版了一大批广受读者喜爱的好书，形成了以文学、大众社科、少儿、音乐为主要出版方向的产品线。目前，现代出版社有限公司年出版图书600余种，其中引进和输出版权图书200余种。",
        "list": [
            {
                "title": "1978~2008中国优秀中篇小说",
                "newPrice": 12.9,
                "oldPrice": 43,
                "author": "孟繁华",
                "img": "press16.jpg"
            },
            {
                "title": "食一碗乡味儿",
                "newPrice": 13.1,
                "oldPrice": 32,
                "author": "汪雪英",
                "img": "press17.jpg"
            },
            {
                "title": "老夫子魔法教室:成语班.2",
                "newPrice": 4.7,
                "oldPrice": 12,
                "author": "王泽",
                "img": "press18.jpg"
            },
            {
                "title": "百年漫画（上下）——中国文库",
                "newPrice": 26.3,
                "oldPrice": 35,
                "author": "黄远林",
                "img": "press19.jpg"
            },
            {
                "title": "晚年周作人",
                "newPrice": 13.3,
                "oldPrice": 35,
                "author": "耿传明",
                "img": "press20.jpg"
            }
        ]
    },
    {
        "name": "广西师范大学出版社",
        "desc": "广西师范大学出版社履践自身文化使命，出版了一大批高水平的学术人文图书，在海内外学术文化界享有盛誉，如“理想国”译丛、“温故”系列、影像阅读系列、“电影馆”系列、海外学人名著系列、大学名师讲课实录系列、《中国思想学术史》、《西方社会史》以及钱穆、何炳棣、劳思光、杜维明、李欧梵、黄仁宇、许倬云、余英时、白先勇、王尔敏、孙隆基、傅斯年、钱存训、木心、梁羽生、朱光潜、王世襄、叶澜、陈丹青、钱理群、李泽厚、韦伯、房龙、纪德、雅尔卡、尼尔·波兹曼、瓦尔特·本雅明等一大批中外学者的著名著作，都是畅销多年的优秀图书。",
        "list": [
            {
                "title": "百家讲坛－孟宪实讲唐史",
                "newPrice": 8,
                "oldPrice": 25,
                "author": "孟宪实　著",
                "img": "press21.jpg"
            },
            {
                "title": "哀悼乳房",
                "newPrice": 12.5,
                "oldPrice": 29,
                "author": "西西",
                "img": "press22.jpg"
            },
            {
                "title": "近代中国的反光镜",
                "newPrice": 27.4,
                "oldPrice": 56,
                "author": "秦风",
                "img": "press23.jpg"
            },
            {
                "title": "费城风云-美国宪法的诞生和我们的反思",
                "newPrice": 10.2,
                "oldPrice": 32,
                "author": "易中天",
                "img": "press24.jpg"
            },
            {
                "title": "永乐大帝",
                "newPrice": 9,
                "oldPrice": 30,
                "author": "商传",
                "img": "press25.jpg"
            }
        ]
    },
    {
        "name": "人民出版社",
        "desc": "人民出版社在哲学社会科学领域，出版了《世界通史》、《中国通史》、《中国学术通史》、《中国民俗史》、《哲学史家文库》、《中国哲学史新编》、《柏拉图全集》等一大批学术精品著作，奠定了人民出版社在哲学社会科学领域的重要地位。",
        "list": [
            {
                "title": "明堂制度源流考",
                "newPrice": 6.4,
                "oldPrice": 20,
                "author": "张一兵",
                "img": "press26.jpg"
            },
            {
                "title": "孟德斯鸠与《论法的精神》(上册)",
                "newPrice": 6.4,
                "oldPrice": 20,
                "author": "高尚",
                "img": "press27.jpg"
            },
            {
                "title": "中国资本主义发展史(全五册)--中国文库. 哲学社会科学类",
                "newPrice": 110.5,
                "oldPrice": 130,
                "author": "许涤新",
                "img": "press28.jpg"
            },
            {
                "title": "论无限.宇宙和诸世界",
                "newPrice": 8.6,
                "oldPrice": 20,
                "author": "布鲁诺",
                "img": "press29.jpg"
            },
            {
                "title": "卢梭与《社会契约论》",
                "newPrice": 4.2,
                "oldPrice": 12,
                "author": "张恒山",
                "img": "press30.jpg"
            }
        ]
    },
    {
        "name": "青岛出版社",
        "desc": "青岛出版社成立于1987年1月12日，是一家城市出版社，坐落在黄海之滨的青岛，以出版大众健康、美食菜谱、医学保健、少儿成长、社科人文、教材教辅类图书为重，并出版7种期刊和一份日报，在出版界素来追求“社风正派、书品高洁”之境界。据北京开卷的统计数据，2007年，青岛出版社图书在中国图书零售市场上综合排名第32位。其中，生活类图书排名全国第一，大众健康类图书稳居全国前3位，美食类图书稳居全国前5位。",
        "list": [
            {
                "title": "小学生如何写好作文",
                "newPrice": 12,
                "oldPrice": 28,
                "author": "梁晓声",
                "img": "press31.jpg"
            },
            {
                "title": "100次哭泣",
                "newPrice": 6.8,
                "oldPrice": 18,
                "author": "(日)中村航",
                "img": "press32.jpg"
            },
            {
                "title": "中学英语小小说(第一辑)鬼屋探险",
                "newPrice": 2.7,
                "oldPrice": 9,
                "author": "帕特利克.法莱尔",
                "img": "press33.jpg"
            },
            {
                "title": "本味家常菜 : 凉拌、小炒、汤煲3688例",
                "newPrice": 14.8,
                "oldPrice": 39,
                "author": "屈浩主编",
                "img": "press34.jpg"
            },
            {
                "title": "电影大师黑泽明",
                "newPrice": 24,
                "oldPrice": 49,
                "author": "刘德润",
                "img": "press35.jpg"
            }
        ]
    },
    {
        "name": "长江文艺出版社",
        "desc": "长江文艺出版社成立于1955年，已出版图书5000余种，与境外出版机构达成版权贸易200余种，发行网络遍布全国。长江文艺出版社秉持“大众文化、精英趣味、百姓情怀”的出版理念，为广大读者及出版界提供品种丰富，文化含量高的优质图书，长期以来在全国文学类图书零售市场占有率均排名第一。活跃于中国文坛的知名作家、诗人、学者，如苏童、余华、余秋雨、二月河、方方、池莉、刘震云、王蒙、王小波、顾城、海子、舒婷、严歌苓、陈忠实、周国平、毕淑敏、刘墉等人的第一本著作或力作均由长江文艺出版社出版。",
        "list": [
            {
                "title": "檀香刑",
                "newPrice": 11.6,
                "oldPrice": 27,
                "author": "莫言",
                "img": "press36.jpg"
            },
            {
                "title": "谋杀的解析:小说版《梦的解析》",
                "newPrice": 11.2,
                "oldPrice": 34.9,
                "author": "(美)鲁本菲尔德(Jed Rubenfe",
                "img": "press37.jpg"
            },
            {
                "title": "千秋",
                "newPrice": 9.2,
                "oldPrice": 28.8,
                "author": "落落",
                "img": "press38.jpg"
            },
            {
                "title": "我钻进了金字塔",
                "newPrice": 12.2,
                "oldPrice": 38,
                "author": "唐师曾　著",
                "img": "press39.jpg"
            },
            {
                "title": "水浒传-百家汇评本(全2册)",
                "newPrice": 22.3,
                "oldPrice": 69.8,
                "author": "施耐庵",
                "img": "press40.jpg"
            }
        ]
    },
    {
        "name": "河北教育出版社",
        "desc": "河北教育出版社成立于1986年12月。经过20多年的发展，现已成长为下辖6个职能部门、9个编辑室，以及河北人文网、快乐教育网、河北教育出版社局域网等3家网站，《快乐作文》杂志社、《21世纪中学生作文》杂志社、《快乐英语》杂志社等3家杂志社，有员工300余名，年出版图书逾千种，所出图书涵盖文化、教育、文学、艺术、社科、儿童、辞书等几大门类，年销售码洋逾2亿、总资产过3亿的品牌大社，成为广大教育工作者的精神家园。",
        "list": [
            {
                "title": "林泉",
                "newPrice": 4.7,
                "oldPrice": 13.5,
                "author": "林清玄",
                "img": "press41.jpg"
            },
            {
                "title": "冰岛的凶汉",
                "newPrice": 6.4,
                "oldPrice": 19.9,
                "author": "[法]维克多.雨果",
                "img": "press42.jpg"
            },
            {
                "title": "二刻拍案惊奇——古典名著",
                "newPrice": 7.9,
                "oldPrice": 17.5,
                "author": "凌濛初",
                "img": "press43.jpg"
            },
            {
                "title": "菩提系列散文精选--情的菩提",
                "newPrice": 10.1,
                "oldPrice": 25.8,
                "author": "林清玄",
                "img": "press44.jpg"
            },
            {
                "title": "雨果戏剧集(共二卷)",
                "newPrice": 19,
                "oldPrice": 54.2,
                "author": "雨果",
                "img": "press45.jpg"
            }
        ]
    },
    {
        "name": "云南人民出版社",
        "desc": "云南人民出版社成立于1950年12月25日，是云南省唯一一家综合性出版社，图书出版范围包括社会科学、历史、文化、文学、艺术、古籍、工具书、摄影、教辅等方面以及音像电子出版物和网络出版社物。九十年代以来，云南人民出版社共有16种155本图书荣获国家图书三大奖。出版了《纳西东巴古籍译注全集》（100卷）、《中华民族的形成与凝聚新论》《云天红霄——人民卫士方红霄》《哲学理论创新丛书》（9种）、《姜亮夫全集》（24卷）、《我们的连队》《殷墟花园庄东地甲骨》等有影响的图书，形成了云南人民出版社的品牌优势。",
        "list": [
            {
                "title": "中国古代交通图典",
                "newPrice": 27,
                "oldPrice": 55,
                "author": "郑若葵",
                "img": "press46.jpg"
            },
            {
                "title": "石屏随笔",
                "newPrice": 9.9,
                "oldPrice": 23,
                "author": "缪崇群",
                "img": "press47.jpg"
            },
            {
                "title": "太后与我",
                "newPrice": 10.8,
                "oldPrice": 36,
                "author": "埃蒙德·特拉内·巴恪思爵士（英）&nbsp;著，王笑歌&nbsp;译",
                "img": "press48.jpg"
            },
            {
                "title": "西域艺术史",
                "newPrice": 43.8,
                "oldPrice": 125,
                "author": "王嵘",
                "img": "press49.jpg"
            },
            {
                "title": "黑奴王子",
                "newPrice": 9,
                "oldPrice": 28,
                "author": "（法）雨果　著，谢百魁　译",
                "img": "press50.jpg"
            }
        ]
    },
    {
        "name": "海豚出版社",
        "desc": "海豚出版社成立于1986年，隶属于中国外文局，是中国少儿图书工作委员会成员单位之一，以出版儿童读物、教育、社会科学等图书见长。近年来，出版社推出的一系列精品图书上市后备受瞩目和赞许，如董桥系列、海豚书馆、海豚文存、独立文丛、《中国读本》（青少年版）、“丰子恺儿童文学全集”、《时光电影院》、《我不是完美小孩》、《格萨尔王》漫画丛书等。",
        "list": [
            {
                "title": "蒙娜丽莎的微笑",
                "newPrice": 9.8,
                "oldPrice": 15.8,
                "author": "格非",
                "img": "press51.jpg"
            },
            {
                "title": "1.2.3木头人",
                "newPrice": 10.9,
                "oldPrice": 32,
                "author": "幾米",
                "img": "press52.jpg"
            },
            {
                "title": "中学生小品-丰子恺儿童文学全集",
                "newPrice": 5.1,
                "oldPrice": 13,
                "author": "丰子恺",
                "img": "press53.jpg"
            },
            {
                "title": "桥-(手稿本)",
                "newPrice": 10.6,
                "oldPrice": 28,
                "author": "废名",
                "img": "press54.jpg"
            },
            {
                "title": "文明国",
                "newPrice": 7.6,
                "oldPrice": 20,
                "author": "丰子恺 (作者), 蒋风 (编者)",
                "img": "press55.jpg"
            }
        ]
    },
    {
        "name": "天津人民出版社",
        "desc": "天津人民出版社在政治学、国际关系、现代文学、民俗文化等若干学科领域，每年推出一些有很高水准的系列学术精品。例如《西方政治思想史》、《徐志摩全集》、《丁玲年谱长编》、《沈从文年谱》、《中国政治制度史》、《湘西南木雕》、《佛教文化百科》、《京剧知识词典》、“法国大学128丛书”等都是上乘之作。此外，《我是刘心武》、《其实你不懂天津人》等文化普及读物还曾荣登全国畅销书排行榜。",
        "list": [
            {
                "title": "人生有趣",
                "newPrice": 24.4,
                "oldPrice": 49.8,
                "author": "汪曾祺著",
                "img": "press56.jpg"
            },
            {
                "title": "雍正继位新探",
                "newPrice": 8.6,
                "oldPrice": 20,
                "author": "冯尔康  著",
                "img": "press57.jpg"
            },
            {
                "title": "人间小暖",
                "newPrice": 21.4,
                "oldPrice": 49.8,
                "author": "汪曾祺著",
                "img": "press58.jpg"
            },
            {
                "title": "汪曾祺-流年忆昔+四方食事+草木春秋(精华典藏本)",
                "newPrice": 74.1,
                "oldPrice": 114,
                "author": "汪曾祺",
                "img": "press59.jpg"
            },
            {
                "title": "福尔摩斯探案：英汉对照：2：五个橘核 紫叶山毛榉案",
                "newPrice": 2.8,
                "oldPrice": 8,
                "author": "[英]柯南·道尔[A",
                "img": "press60.jpg"
            }
        ]
    }
];
localStorage.setItem("pressList",JSON.stringify(pressList));
